<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages latest version of Dremel DigiLab 3D Slicer.</string>
    <key>Identifier</key>
    <string>com.github.killer23d.pkg.DremelDigiLab3DSlicer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DremelDigiLab3DSlicer</string> 
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.nstrauss.download.DremelDigiLab3DSlicer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%RECIPE_CACHE_DIR%/app/Dremel3DSlicer-%version%-mac/Dremel DigiLab 3D Slicer.app</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
