<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GIMP, creates PKG, uploads it to the JSS and creates SelfService Policy.</string>
	<key>Identifier</key>
	<string>com.github.killer23d.jss.GIMP</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>BE / IT Software</string>
		<key>GROUP_NAME</key>
		<string></string>
		<key>GROUP_TEMPLATE</key>
		<string></string>
		<key>NAME</key>
		<string>GIMP</string>
		<key>POLICY_TEMPLATE</key>
		<string></string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>GIMP (an acronym for GNU Image Manipulation Program) is a free and open-source raster graphics editor used for image retouching and editing, free-form drawing, resizing, cropping, photo-montages, converting between different image formats, and more specialized tasks.</string>
		<key>SELF_SERVICE_ICON</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.killer23d.pkg.GIMP</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>%JSS_INVENTORY_NAME%</string>
				<key>package_info</key>
				<string>%PKGINAME% %version%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_feature_mainpage</key>
				<string>%SELF_SERVICE_FEATURE_MAINPAGE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
